models/Menu.php

    public static function view($parent)
    {

        if (empty($parent)) {
            return false;
        }

        return static::find()->where(['is_using' => 'On', 'parent_id' => $parent])
            ->orderBy('sort_id', 'ASC')
            ->asArray()
            ->all();
---
SELECT * FROM `F_menu` WHERE (`is_using`='On') AND (`parent_id`='H1') ORDER BY `sort_id`

    public static function findByMenu($id)
    {
        if (empty($id)) {
            return false;
        }

        return static::find()->where(['mkey' => $id])->asArray()->one();
---
SELECT * FROM `F_menu` WHERE `mkey`='HN1'